# Лабораторная работа №4
Выполнила: Дубман Л.Б., гр.6233-010402D

## Преобразование данных в аккуратный вид

### Загрузка библиотек

In [1]:
import numpy as np
import pandas as pd

### Описание данных

In [2]:
df = pd.read_csv('CustomerSegmentation.csv')

In [3]:
df.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,462809,Male,No,22,No,Healthcare,1.0,Low,4.0,Cat_4,D
1,462643,Female,Yes,38,Yes,Engineer,NaN,Average,3.0,Cat_4,A
2,466315,Female,Yes,67,Yes,Engineer,1.0,Low,1.0,Cat_6,B
3,461735,Male,Yes,67,Yes,Lawyer,0.0,High,2.0,Cat_6,B
4,462669,Female,Yes,40,Yes,Entertainment,NaN,High,6.0,Cat_6,A

#### Типы данных

* int64 – числовые данные (целые числа): ID, Age.
* float64 – вещественные числа: Work_Experience, Family_Size.
* object – категориальные данные: Gender, Ever_Married, Graduated, Profession, Spending_Score, Var_1, Segmentation.

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8068 entries, 0 to 8067
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               8068 non-null   int64
 1   Gender           8068 non-null   object
 2   Ever_Married     7928 non-null   object
 3   Age              8068 non-null   int64
 4   Graduated        7990 non-null   object
 5   Profession       7944 non-null   object
 6   Work_Experience  7239 non-null   float64
 7   Spending_Score   8068 non-null   object
 8   Family_Size      7733 non-null   float64
 9   Var_1            7992 non-null   object
 10  Segmentation     8068 non-null   object
dtypes: float64(2), int64(2), object(7)
memory usage: 693.5+ KB

### Обнаружение и удаление пропусков в данных

In [5]:
df.isnull().sum()

ID                   0
Gender               0
Ever_Married       140
Age                  0
Graduated           78
Profession         124
Work_Experience    829
Spending_Score       0
Family_Size        335
Var_1               76
Segmentation         0
dtype: int64

In [6]:
# Удаляем пустые значения
df.dropna(inplace=True)

### Анализ памяти и переименование столбцов

In [7]:
df.memory_usage(deep=True).sum()

3114925

In [8]:
df.rename(columns={'Var_1' : 'Customer_category'}, inplace=True)

In [9]:
df.keys()

Index(['ID', 'Gender', 'Ever_Married', 'Age', 'Graduated', 'Profession',
       'Work_Experience', 'Spending_Score', 'Family_Size', 'Customer_category',
       'Segmentation'],
      dtype='object')

### Создание подгрупп данных

In [10]:
personal_df = df[['ID', 'Gender', 'Ever_Married', 'Age', 'Spending_Score', 'Family_Size']]
experience_df = df[['ID', 'Graduated', 'Profession', 'Work_Experience']]
target_df = df[['ID', 'Customer_category','Segmentation']]

* personal_df: Содержит личные данные клиента, включая пол, семейный статус, возраст, траты и размер семьи.

* experience_df: Хранит информацию об образовании, профессии и стаже работы клиента.

* target_df: Содержит данные для целевой сегментации: категорию клиента и сегментацию.

### Оценка памяти, занимаемой подгруппами данных

Считает общий объем памяти, занимаемой тремя подгруппами данных.

In [11]:
personal_df.memory_usage(deep=True).sum() +\
experience_df.memory_usage(deep=True).sum() +\
target_df.memory_usage(deep=True).sum()

3328205

#### Просмотр промежуточных результатов

In [12]:
personal_df.head()

       ID  Gender Ever_Married  Age Spending_Score  Family_Size
0  462809    Male           No   22            Low          4.0
2  466315  Female          Yes   67            Low          1.0
3  461735    Male          Yes   67           High          2.0
5  461319    Male          Yes   56        Average          2.0
6  460156    Male           No   32            Low          3.0

In [13]:
experience_df.head()

       ID Graduated  Profession  Work_Experience
0  462809        No  Healthcare              1.0
2  466315       Yes    Engineer              1.0
3  461735       Yes      Lawyer              0.0
5  461319        No      Artist              0.0
6  460156       Yes  Healthcare              1.0

In [14]:
target_df.head()

       ID Customer_category Segmentation
0  462809             Cat_4            D
2  466315             Cat_6            B
3  461735             Cat_6            B
5  461319             Cat_6            C
6  460156             Cat_6            C

### Агрегация данных

In [15]:
agg = personal_df.groupby(['Gender', 'Ever_Married', 'Spending_Score'])[['Age', 'Family_Size']].agg(['mean']).astype(int)
agg

                                    Age Family_Size
                                   mean        mean
Gender Ever_Married Spending_Score
Female No           Low              33           2
       Yes          Average          47           3
                    High             61           2
                    Low              49           1
Male   No           Low              30           3
       Yes          Average          46           3
                    High             56           3
                    Low              52           2

* Группирует данные в personal_df по полу (Gender), семейному статусу (Ever_Married) и тратам (Spending_Score).

* Вычисляет средний возраст и размер семьи для каждой группы.

* Преобразует результаты в целые числа (astype(int)).

In [16]:
agg1 = experience_df.groupby(['Graduated', 'Profession'])['Work_Experience'].agg(['mean', 'max', 'min']).astype(int)
agg1

                         mean  max  min
Graduated Profession
No        Artist            2   14    0
          Doctor            2   14    0
          Engineer          2   14    0
          Entertainment     2   14    0
          Executive         2   13    0
          Healthcare        2   14    0
          Homemaker         6   14    0
          Lawyer            0   13    0
          Marketing         1   11    0
Yes       Artist            2   14    0
          Doctor            2   14    0
          Engineer          2   12    0
          Entertainment     2   14    0
          Executive         2   11    0
          Healthcare        3   14    0
          Homemaker         6   14    0
          Lawyer            1   14    0
          Marketing         3   13    0

* Группирует данные в experience_df по образованию (Graduated) и профессии (Profession).

* Вычисляет средний (mean), максимальный (max) и минимальный (min) стаж работы для каждой группы.

* Преобразует результаты в целые числа.

In [17]:
agg2 = experience_df.groupby(['Graduated', 'Profession'])['Work_Experience'].agg(['mean']).astype(int)
agg2.unstack('Graduated')

              mean
Graduated       No Yes
Profession
Artist           2   2
Doctor           2   2
Engineer         2   2
Entertainment    2   2
Executive        2   2
Healthcare       2   3
Homemaker        6   6
Lawyer           0   1
Marketing        1   3

1) Группировка данных:
Данные из experience_df группируются по признакам:

* Graduated: Указывает, имеет ли человек высшее образование.
* Profession: Отражает профессию человека.

2) Агрегация данных:
Для каждой группы (сочетания значений Graduated и Profession) рассчитывается:

* mean: Среднее значение стажа работы (Work_Experience).
Полученные средние значения преобразуются в целые числа (astype(int)

3) Приведение данных к широкому формату для лучшей визуализации таблицы:
Используется метод unstack('Graduated'):

* Перемещает уровень индекса Graduated в столбцы.

Это делает данные удобными для визуального анализа, поскольку для каждой профессии можно увидеть средний стаж работы отдельно для выпускников (Yes) и тех, кто не закончил вуз (No).